fix: update to mermaid for content
